In [18]:
import pymysql
from sqlalchemy import create_engine

import pandas as pd

import getpass

password = getpass.getpass()

········

In [19]:
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)

In [20]:
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

# 7. Create a Python connection with SQL database and retrieve the results of the last two queries (also mentioned below) as dataframes:

# 7.1 Check the number of rentals for each customer for May

In [21]:
Data_May = """
        SELECT
	c.first_name,
    c.last_name,
	c.customer_id,
	count(rental_id) as num_of_rentals
FROM sakila.rentals_may r
JOIN sakila.customer c ON c.customer_id = r.customer_id
GROUP BY r.customer_id
order by num_of_rentals desc

        """

pd.read_sql_query(Data_May,engine)

    first_name  last_name  customer_id  num_of_rentals
0          SUE     PETERS          197               8
1         EDNA       WEST          109               7
2       LESLIE     SEWARD          506               7
3         RUTH   MARTINEZ           19               6
4      HEATHER     MORRIS           53               6
..         ...        ...          ...             ...
515       ROSS       GREY          580               1
516       ANDY    VANHORN          582               1
517       SETH     HANNON          590               1
518   TERRENCE  GUNDERSON          595               1
519     AUSTIN    CINTRON          599               1

[520 rows x 4 columns]

# 7.2 Check the number of rentals for each customer for June

In [22]:
Data_June = """
        SELECT
	c.first_name,
    c.last_name,
	c.customer_id,
	count(rental_id) as num_of_rentals
FROM sakila.rentals_june r
JOIN sakila.customer c ON c.customer_id = r.customer_id
GROUP BY r.customer_id
order by num_of_rentals desc

        """

pd.read_sql_query(Data_June,engine)

    first_name    last_name  customer_id  num_of_rentals
0       BRENDA       WRIGHT           31              11
1         ALEX      GRESHAM          454              10
2         GINA   WILLIAMSON          213               9
3       MARGIE         WADE          267               9
4        DAISY        BATES          295               9
..         ...          ...          ...             ...
585     NELSON  CHRISTENSON          549               1
586     DWIGHT     LOMBARDI          555               1
587        BOB     PFEIFFER          564               1
588       ROSS         GREY          580               1
589       WADE     DELVALLE          598               1

[590 rows x 4 columns]

# Write a function that checks if customer borrowed more or less films in the month of June as compared to May.

In [81]:
import pandas as pd
import numpy as np

In [44]:
data_may = """
               SELECT
	c.first_name,
    c.last_name,
	c.customer_id,
	count(rental_id) as num_of_rentals
FROM sakila.rentals_may r
JOIN sakila.customer c ON c.customer_id = r.customer_id
GROUP BY r.customer_id
        """

pd.read_sql_query(data_may,engine)

    first_name  last_name  customer_id  num_of_rentals
0         MARY      SMITH            1               2
1     PATRICIA    JOHNSON            2               1
2        LINDA   WILLIAMS            3               2
3    ELIZABETH      BROWN            5               3
4     JENNIFER      DAVIS            6               3
..         ...        ...          ...             ...
515    EDUARDO      HIATT          594               4
516   TERRENCE  GUNDERSON          595               1
517    ENRIQUE   FORSYTHE          596               6
518    FREDDIE     DUGGAN          597               2
519     AUSTIN    CINTRON          599               1

[520 rows x 4 columns]

In [45]:
data_may = pd.read_sql_query(data_may,engine)
data_may

    first_name  last_name  customer_id  num_of_rentals
0         MARY      SMITH            1               2
1     PATRICIA    JOHNSON            2               1
2        LINDA   WILLIAMS            3               2
3    ELIZABETH      BROWN            5               3
4     JENNIFER      DAVIS            6               3
..         ...        ...          ...             ...
515    EDUARDO      HIATT          594               4
516   TERRENCE  GUNDERSON          595               1
517    ENRIQUE   FORSYTHE          596               6
518    FREDDIE     DUGGAN          597               2
519     AUSTIN    CINTRON          599               1

[520 rows x 4 columns]

In [46]:
data_june = """
        SELECT
	c.first_name,
    c.last_name,
	c.customer_id,
	count(rental_id) as num_of_rentals
FROM sakila.rentals_june r
JOIN sakila.customer c ON c.customer_id = r.customer_id
GROUP BY r.customer_id
        """
pd.read_sql_query(data_june,engine)

    first_name  last_name  customer_id  num_of_rentals
0         MARY      SMITH            1               7
1     PATRICIA    JOHNSON            2               1
2        LINDA   WILLIAMS            3               4
3      BARBARA      JONES            4               6
4    ELIZABETH      BROWN            5               5
..         ...        ...          ...             ...
585   TERRENCE  GUNDERSON          595               2
586    ENRIQUE   FORSYTHE          596               2
587    FREDDIE     DUGGAN          597               3
588       WADE   DELVALLE          598               1
589     AUSTIN    CINTRON          599               4

[590 rows x 4 columns]

In [47]:
data_june = pd.read_sql_query(data_june,engine)

In [48]:
data_june

    first_name  last_name  customer_id  num_of_rentals
0         MARY      SMITH            1               7
1     PATRICIA    JOHNSON            2               1
2        LINDA   WILLIAMS            3               4
3      BARBARA      JONES            4               6
4    ELIZABETH      BROWN            5               5
..         ...        ...          ...             ...
585   TERRENCE  GUNDERSON          595               2
586    ENRIQUE   FORSYTHE          596               2
587    FREDDIE     DUGGAN          597               3
588       WADE   DELVALLE          598               1
589     AUSTIN    CINTRON          599               4

[590 rows x 4 columns]

# I create two functions because in the firts one i didn't like the output, it got really confusing.So i create the second one that gives an output with a new column in the table.

In [75]:
def compare_films(data_may, data_june):
    data_combined = pd.merge(data_may, data_june, on='customer_id')
    data_combined.rename(columns={'num_of_rentals_x': 'num_of_rentals_may'}, inplace=True)
    data_combined.rename(columns={'num_of_rentals_y': 'num_of_rentals_june'}, inplace=True)
    data_combined.drop(['first_name_y'],axis=1,inplace=True)
    data_combined.drop(['last_name_y'],axis=1,inplace=True)
    data_combined['difference']= data_combined['num_of_rentals_may'] - data_combined['num_of_rentals_june']
    for customer_id in set(data_combined['customer_id']):
        df_customer = data_combined[data_combined['customer_id'] == customer_id]
        num_of_rentals_may = df_customer['num_of_rentals_may'].iloc[0]
        num_of_rentals_june = df_customer['num_of_rentals_june'].iloc[0]
        if num_of_rentals_may > num_of_rentals_june:
            print(f"O customer_id {customer_id} alugou mais filmes em Maio")
        elif num_of_rentals_may == num_of_rentals_june:
            print(f"O customer_id {customer_id} alugou o mesmo número de filmes em Maio e Junho")
        else:
            print(f"O customer_id {customer_id} alugou mais filmes em Junho")
    return data_combined

In [78]:
compare_films(data_may,data_june)

O customer_id 1 alugou mais filmes em Junho
O customer_id 2 alugou o mesmo número de filmes em Maio e Junho
O customer_id 3 alugou mais filmes em Junho
O customer_id 5 alugou mais filmes em Junho
O customer_id 6 alugou mais filmes em Junho
O customer_id 7 alugou o mesmo número de filmes em Maio e Junho
O customer_id 8 alugou mais filmes em Junho
O customer_id 9 alugou mais filmes em Maio
O customer_id 10 alugou mais filmes em Junho
O customer_id 11 alugou mais filmes em Junho
O customer_id 12 alugou mais filmes em Junho
O customer_id 14 alugou mais filmes em Maio
O customer_id 16 alugou o mesmo número de filmes em Maio e Junho
O customer_id 17 alugou o mesmo número de filmes em Maio e Junho
O customer_id 18 alugou mais filmes em Junho
O customer_id 19 alugou mais filmes em Maio
O customer_id 20 alugou mais filmes em Junho
O customer_id 21 alugou mais filmes em Junho
O customer_id 22 alugou mais filmes em Maio
O customer_id 23 alugou mais filmes em Junho
O customer_id 24 alugou mais filmes em Junho
O customer_id 25 alugou mais filmes em Junho
O customer_id 26 alugou mais filmes em Junho
O customer_id 27 alugou mais filmes em Junho
O customer_id 28 alugou mais filmes em Junho
O customer_id 29 alugou mais filmes em Junho
O customer_id 32 alugou mais filmes em Junho
O customer_id 33 alugou mais filmes em Junho
O customer_id 35 alugou mais filmes em Junho
O customer_id 36 alugou mais filmes em Maio
O customer_id 37 alugou mais filmes em Junho
O customer_id 40 alugou mais filmes em Junho
O customer_id 42 alugou mais filmes em Junho
O customer_id 43 alugou mais filmes em Maio
O customer_id 44 alugou mais filmes em Maio
O customer_id 45 alugou mais filmes em Junho
O customer_id 46 alugou mais filmes em Junho
O customer_id 47 alugou o mesmo número de filmes em Maio e Junho
O customer_id 48 alugou mais filmes em Maio
O customer_id 49 alugou mais filmes em Junho
O customer_id 50 alugou mais filmes em Maio
O customer_id 51 alugou mais filmes em Maio
O customer_id 52 alugou mais filmes em Junho
O customer_id 53 alugou mais filmes em Maio
O customer_id 54 alugou mais filmes em Junho
O customer_id 55 alugou mais filmes em Junho
O customer_id 56 alugou o mesmo número de filmes em Maio e Junho
O customer_id 57 alugou mais filmes em Junho
O customer_id 58 alugou o mesmo número de filmes em Maio e Junho
O customer_id 59 alugou o mesmo número de filmes em Maio e Junho
O customer_id 60 alugou mais filmes em Maio
O customer_id 62 alugou mais filmes em Junho
O customer_id 64 alugou mais filmes em Maio
O customer_id 65 alugou o mesmo número de filmes em Maio e Junho
O customer_id 66 alugou mais filmes em Junho
O customer_id 67 alugou mais filmes em Junho
O customer_id 69 alugou o mesmo número de filmes em Maio e Junho
O customer_id 70 alugou o mesmo número de filmes em Maio e Junho
O customer_id 71 alugou mais filmes em Junho
O customer_id 72 alugou mais filmes em Maio
O customer_id 73 alugou o mesmo número de filmes em Maio e Junho
O customer_id 74 alugou mais filmes em Junho
O customer_id 75 alugou mais filmes em Junho
O customer_id 76 alugou mais filmes em Junho
O customer_id 77 alugou o mesmo número de filmes em Maio e Junho
O customer_id 79 alugou mais filmes em Maio
O customer_id 81 alugou mais filmes em Junho
O customer_id 82 alugou mais filmes em Junho
O customer_id 83 alugou mais filmes em Junho
O customer_id 84 alugou mais filmes em Junho
O customer_id 85 alugou mais filmes em Junho
O customer_id 86 alugou mais filmes em Junho
O customer_id 87 alugou mais filmes em Junho
O customer_id 88 alugou mais filmes em Junho
O customer_id 89 alugou mais filmes em Junho
O customer_id 91 alugou mais filmes em Junho
O customer_id 92 alugou mais filmes em Junho
O customer_id 93 alugou mais filmes em Maio
O customer_id 94 alugou mais filmes em Junho
O customer_id 95 alugou mais filmes em Junho
O customer_id 98 alugou mais filmes em Junho
O customer_id 99 alugou mais filmes em Junho
O customer_id 100 alugou mais filmes em Junho
O customer_id 102 alugou mais filmes em Maio
O customer_id 103 alugou mais filmes em Junho
O customer_id 104 alugou mais filmes em Junho
O customer_id 105 alugou mais filmes em Maio
O customer_id 106 alugou o mesmo número de filmes em Maio e Junho
O customer_id 107 alugou mais filmes em Junho
O customer_id 108 alugou mais filmes em Junho
O customer_id 109 alugou mais filmes em Maio
O customer_id 110 alugou mais filmes em Maio
O customer_id 111 alugou mais filmes em Junho
O customer_id 112 alugou mais filmes em Junho
O customer_id 113 alugou mais filmes em Junho
O customer_id 114 alugou mais filmes em Junho
O customer_id 115 alugou o mesmo número de filmes em Maio e Junho
O customer_id 116 alugou mais filmes em Junho
O customer_id 117 alugou o mesmo número de filmes em Maio e Junho
O customer_id 118 alugou mais filmes em Junho
O customer_id 119 alugou o mesmo número de filmes em Maio e Junho
O customer_id 120 alugou mais filmes em Junho
O customer_id 121 alugou mais filmes em Junho
O customer_id 122 alugou mais filmes em Junho
O customer_id 123 alugou mais filmes em Junho
O customer_id 124 alugou mais filmes em Maio
O customer_id 125 alugou mais filmes em Junho
O customer_id 126 alugou mais filmes em Maio
O customer_id 127 alugou mais filmes em Junho
O customer_id 128 alugou o mesmo número de filmes em Maio e Junho
O customer_id 130 alugou mais filmes em Junho
O customer_id 131 alugou mais filmes em Maio
O customer_id 133 alugou mais filmes em Junho
O customer_id 134 alugou o mesmo número de filmes em Maio e Junho
O customer_id 135 alugou mais filmes em Junho
O customer_id 136 alugou o mesmo número de filmes em Maio e Junho
O customer_id 137 alugou mais filmes em Junho
O customer_id 138 alugou mais filmes em Junho
O customer_id 141 alugou mais filmes em Junho
O customer_id 142 alugou mais filmes em Maio
O customer_id 143 alugou mais filmes em Junho
O customer_id 144 alugou mais filmes em Junho
O customer_id 145 alugou mais filmes em Junho
O customer_id 146 alugou mais filmes em Junho
O customer_id 147 alugou mais filmes em Junho
O customer_id 148 alugou mais filmes em Junho
O customer_id 149 alugou mais filmes em Junho
O customer_id 150 alugou mais filmes em Maio
O customer_id 151 alugou mais filmes em Junho
O customer_id 152 alugou mais filmes em Maio
O customer_id 154 alugou o mesmo número de filmes em Maio e Junho
O customer_id 155 alugou mais filmes em Junho
O customer_id 156 alugou mais filmes em Junho
O customer_id 157 alugou mais filmes em Maio
O customer_id 158 alugou mais filmes em Junho
O customer_id 159 alugou mais filmes em Maio
O customer_id 161 alugou mais filmes em Maio
O customer_id 162 alugou mais filmes em Junho
O customer_id 164 alugou mais filmes em Junho
O customer_id 165 alugou mais filmes em Junho
O customer_id 166 alugou mais filmes em Junho
O customer_id 167 alugou o mesmo número de filmes em Maio e Junho
O customer_id 168 alugou mais filmes em Maio
O customer_id 169 alugou o mesmo número de filmes em Maio e Junho
O customer_id 170 alugou mais filmes em Maio
O customer_id 171 alugou mais filmes em Junho
O customer_id 172 alugou o mesmo número de filmes em Maio e Junho
O customer_id 173 alugou mais filmes em Junho
O customer_id 174 alugou mais filmes em Junho
O customer_id 176 alugou mais filmes em Junho
O customer_id 179 alugou mais filmes em Maio
O customer_id 180 alugou mais filmes em Junho
O customer_id 181 alugou mais filmes em Junho
O customer_id 182 alugou mais filmes em Junho
O customer_id 183 alugou mais filmes em Junho
O customer_id 184 alugou mais filmes em Maio
O customer_id 185 alugou o mesmo número de filmes em Maio e Junho
O customer_id 186 alugou mais filmes em Junho
O customer_id 187 alugou mais filmes em Junho
O customer_id 189 alugou mais filmes em Junho
O customer_id 190 alugou mais filmes em Junho
O customer_id 191 alugou mais filmes em Junho
O customer_id 192 alugou o mesmo número de filmes em Maio e Junho
O customer_id 193 alugou mais filmes em Junho
O customer_id 194 alugou mais filmes em Junho
O customer_id 196 alugou mais filmes em Junho
O customer_id 197 alugou o mesmo número de filmes em Maio e Junho
O customer_id 198 alugou mais filmes em Maio
O customer_id 199 alugou mais filmes em Junho
O customer_id 200 alugou mais filmes em Junho
O customer_id 201 alugou mais filmes em Junho
O customer_id 203 alugou mais filmes em Junho
O customer_id 204 alugou mais filmes em Junho
O customer_id 207 alugou mais filmes em Maio
O customer_id 208 alugou mais filmes em Junho
O customer_id 209 alugou mais filmes em Junho
O customer_id 210 alugou mais filmes em Junho
O customer_id 211 alugou mais filmes em Junho
O customer_id 213 alugou mais filmes em Junho
O customer_id 214 alugou mais filmes em Maio
O customer_id 215 alugou mais filmes em Junho
O customer_id 216 alugou mais filmes em Junho
O customer_id 217 alugou mais filmes em Junho
O customer_id 219 alugou mais filmes em Junho
O customer_id 220 alugou mais filmes em Maio
O customer_id 221 alugou mais filmes em Junho
O customer_id 222 alugou mais filmes em Maio
O customer_id 223 alugou mais filmes em Junho
O customer_id 225 alugou mais filmes em Maio
O customer_id 227 alugou mais filmes em Junho
O customer_id 228 alugou mais filmes em Junho
O customer_id 230 alugou mais filmes em Junho
O customer_id 231 alugou mais filmes em Maio
O customer_id 232 alugou o mesmo número de filmes em Maio e Junho
O customer_id 234 alugou mais filmes em Junho
O customer_id 235 alugou o mesmo número de filmes em Maio e Junho
O customer_id 236 alugou mais filmes em Junho
O customer_id 237 alugou mais filmes em Junho
O customer_id 238 alugou mais filmes em Junho
O customer_id 239 alugou mais filmes em Maio
O customer_id 240 alugou o mesmo número de filmes em Maio e Junho
O customer_id 241 alugou mais filmes em Junho
O customer_id 242 alugou mais filmes em Junho
O customer_id 243 alugou mais filmes em Junho
O customer_id 244 alugou mais filmes em Junho
O customer_id 245 alugou mais filmes em Maio
O customer_id 246 alugou o mesmo número de filmes em Maio e Junho
O customer_id 247 alugou mais filmes em Maio
O customer_id 248 alugou o mesmo número de filmes em Maio e Junho
O customer_id 249 alugou mais filmes em Junho
O customer_id 250 alugou mais filmes em Maio
O customer_id 251 alugou mais filmes em Maio
O customer_id 252 alugou mais filmes em Junho
O customer_id 253 alugou mais filmes em Junho
O customer_id 254 alugou mais filmes em Junho
O customer_id 256 alugou mais filmes em Junho
O customer_id 257 alugou mais filmes em Maio
O customer_id 259 alugou mais filmes em Junho
O customer_id 260 alugou mais filmes em Junho
O customer_id 261 alugou mais filmes em Junho
O customer_id 262 alugou mais filmes em Junho
O customer_id 263 alugou o mesmo número de filmes em Maio e Junho
O customer_id 265 alugou mais filmes em Junho
O customer_id 266 alugou mais filmes em Junho
O customer_id 267 alugou mais filmes em Junho
O customer_id 269 alugou mais filmes em Maio
O customer_id 270 alugou mais filmes em Junho
O customer_id 271 alugou o mesmo número de filmes em Maio e Junho
O customer_id 272 alugou mais filmes em Maio
O customer_id 273 alugou mais filmes em Junho
O customer_id 274 alugou mais filmes em Maio
O customer_id 275 alugou mais filmes em Junho
O customer_id 276 alugou mais filmes em Junho
O customer_id 277 alugou mais filmes em Junho
O customer_id 278 alugou mais filmes em Junho
O customer_id 279 alugou mais filmes em Junho
O customer_id 280 alugou mais filmes em Junho
O customer_id 281 alugou o mesmo número de filmes em Maio e Junho
O customer_id 282 alugou mais filmes em Junho
O customer_id 284 alugou o mesmo número de filmes em Maio e Junho
O customer_id 286 alugou mais filmes em Junho
O customer_id 287 alugou mais filmes em Junho
O customer_id 288 alugou mais filmes em Maio
O customer_id 290 alugou mais filmes em Junho
O customer_id 291 alugou o mesmo número de filmes em Maio e Junho
O customer_id 292 alugou mais filmes em Junho
O customer_id 293 alugou mais filmes em Junho
O customer_id 294 alugou mais filmes em Junho
O customer_id 295 alugou mais filmes em Junho
O customer_id 296 alugou mais filmes em Maio
O customer_id 297 alugou mais filmes em Junho
O customer_id 298 alugou mais filmes em Junho
O customer_id 299 alugou mais filmes em Junho
O customer_id 300 alugou mais filmes em Maio
O customer_id 301 alugou o mesmo número de filmes em Maio e Junho
O customer_id 302 alugou mais filmes em Maio
O customer_id 303 alugou mais filmes em Junho
O customer_id 304 alugou mais filmes em Junho
O customer_id 305 alugou mais filmes em Junho
O customer_id 306 alugou o mesmo número de filmes em Maio e Junho
O customer_id 307 alugou mais filmes em Junho
O customer_id 308 alugou mais filmes em Junho
O customer_id 309 alugou mais filmes em Junho
O customer_id 310 alugou mais filmes em Junho
O customer_id 311 alugou mais filmes em Maio
O customer_id 312 alugou mais filmes em Maio
O customer_id 313 alugou mais filmes em Maio
O customer_id 314 alugou o mesmo número de filmes em Maio e Junho
O customer_id 315 alugou mais filmes em Maio
O customer_id 316 alugou mais filmes em Junho
O customer_id 317 alugou mais filmes em Junho
O customer_id 318 alugou mais filmes em Junho
O customer_id 319 alugou mais filmes em Junho
O customer_id 321 alugou mais filmes em Maio
O customer_id 322 alugou mais filmes em Junho
O customer_id 323 alugou o mesmo número de filmes em Maio e Junho
O customer_id 324 alugou mais filmes em Junho
O customer_id 325 alugou mais filmes em Junho
O customer_id 326 alugou mais filmes em Junho
O customer_id 327 alugou mais filmes em Junho
O customer_id 328 alugou mais filmes em Junho
O customer_id 330 alugou mais filmes em Junho
O customer_id 331 alugou mais filmes em Junho
O customer_id 333 alugou mais filmes em Junho
O customer_id 334 alugou mais filmes em Junho
O customer_id 337 alugou mais filmes em Maio
O customer_id 338 alugou mais filmes em Junho
O customer_id 339 alugou mais filmes em Junho
O customer_id 343 alugou mais filmes em Junho
O customer_id 344 alugou mais filmes em Junho
O customer_id 345 alugou mais filmes em Junho
O customer_id 346 alugou mais filmes em Junho
O customer_id 348 alugou mais filmes em Junho
O customer_id 349 alugou mais filmes em Junho
O customer_id 350 alugou mais filmes em Junho
O customer_id 351 alugou mais filmes em Junho
O customer_id 352 alugou mais filmes em Junho
O customer_id 353 alugou mais filmes em Junho
O customer_id 354 alugou mais filmes em Junho
O customer_id 355 alugou mais filmes em Junho
O customer_id 356 alugou mais filmes em Junho
O customer_id 357 alugou mais filmes em Junho
O customer_id 358 alugou mais filmes em Junho
O customer_id 359 alugou mais filmes em Junho
O customer_id 360 alugou mais filmes em Junho
O customer_id 361 alugou mais filmes em Junho
O customer_id 362 alugou mais filmes em Junho
O customer_id 363 alugou mais filmes em Junho
O customer_id 364 alugou mais filmes em Junho
O customer_id 365 alugou mais filmes em Junho
O customer_id 366 alugou mais filmes em Junho
O customer_id 367 alugou mais filmes em Maio
O customer_id 368 alugou mais filmes em Junho
O customer_id 369 alugou mais filmes em Maio
O customer_id 371 alugou mais filmes em Junho
O customer_id 372 alugou mais filmes em Junho
O customer_id 373 alugou mais filmes em Junho
O customer_id 374 alugou mais filmes em Junho
O customer_id 375 alugou mais filmes em Maio
O customer_id 376 alugou mais filmes em Junho
O customer_id 378 alugou mais filmes em Junho
O customer_id 379 alugou mais filmes em Junho
O customer_id 380 alugou mais filmes em Junho
O customer_id 381 alugou mais filmes em Junho
O customer_id 382 alugou mais filmes em Junho
O customer_id 383 alugou mais filmes em Junho
O customer_id 384 alugou mais filmes em Junho
O customer_id 385 alugou mais filmes em Junho
O customer_id 386 alugou mais filmes em Junho
O customer_id 387 alugou mais filmes em Junho
O customer_id 388 alugou mais filmes em Junho
O customer_id 389 alugou mais filmes em Junho
O customer_id 390 alugou mais filmes em Junho
O customer_id 391 alugou o mesmo número de filmes em Maio e Junho
O customer_id 393 alugou mais filmes em Junho
O customer_id 394 alugou mais filmes em Maio
O customer_id 396 alugou mais filmes em Junho
O customer_id 397 alugou mais filmes em Junho
O customer_id 398 alugou mais filmes em Junho
O customer_id 399 alugou mais filmes em Maio
O customer_id 400 alugou mais filmes em Maio
O customer_id 402 alugou mais filmes em Junho
O customer_id 403 alugou mais filmes em Junho
O customer_id 404 alugou mais filmes em Junho
O customer_id 405 alugou mais filmes em Junho
O customer_id 406 alugou mais filmes em Junho
O customer_id 407 alugou mais filmes em Junho
O customer_id 408 alugou o mesmo número de filmes em Maio e Junho
O customer_id 409 alugou mais filmes em Junho
O customer_id 411 alugou mais filmes em Junho
O customer_id 412 alugou mais filmes em Maio
O customer_id 413 alugou o mesmo número de filmes em Maio e Junho
O customer_id 414 alugou mais filmes em Junho
O customer_id 415 alugou mais filmes em Junho
O customer_id 416 alugou mais filmes em Junho
O customer_id 417 alugou mais filmes em Maio
O customer_id 419 alugou o mesmo número de filmes em Maio e Junho
O customer_id 420 alugou mais filmes em Junho
O customer_id 421 alugou mais filmes em Junho
O customer_id 422 alugou mais filmes em Junho
O customer_id 424 alugou mais filmes em Junho
O customer_id 425 alugou o mesmo número de filmes em Maio e Junho
O customer_id 426 alugou mais filmes em Junho
O customer_id 427 alugou mais filmes em Junho
O customer_id 428 alugou mais filmes em Junho
O customer_id 429 alugou mais filmes em Maio
O customer_id 430 alugou mais filmes em Junho
O customer_id 431 alugou mais filmes em Junho
O customer_id 432 alugou o mesmo número de filmes em Maio e Junho
O customer_id 434 alugou mais filmes em Junho
O customer_id 435 alugou o mesmo número de filmes em Maio e Junho
O customer_id 436 alugou mais filmes em Maio
O customer_id 437 alugou o mesmo número de filmes em Maio e Junho
O customer_id 438 alugou mais filmes em Junho
O customer_id 439 alugou mais filmes em Junho
O customer_id 441 alugou mais filmes em Junho
O customer_id 442 alugou mais filmes em Junho
O customer_id 443 alugou o mesmo número de filmes em Maio e Junho
O customer_id 444 alugou mais filmes em Junho
O customer_id 446 alugou mais filmes em Junho
O customer_id 447 alugou mais filmes em Junho
O customer_id 448 alugou mais filmes em Junho
O customer_id 449 alugou o mesmo número de filmes em Maio e Junho
O customer_id 450 alugou mais filmes em Junho
O customer_id 451 alugou mais filmes em Junho
O customer_id 452 alugou mais filmes em Junho
O customer_id 454 alugou mais filmes em Junho
O customer_id 455 alugou mais filmes em Junho
O customer_id 456 alugou mais filmes em Junho
O customer_id 457 alugou mais filmes em Junho
O customer_id 459 alugou mais filmes em Junho
O customer_id 460 alugou mais filmes em Maio
O customer_id 461 alugou mais filmes em Junho
O customer_id 462 alugou mais filmes em Junho
O customer_id 463 alugou mais filmes em Junho
O customer_id 464 alugou o mesmo número de filmes em Maio e Junho
O customer_id 465 alugou mais filmes em Junho
O customer_id 466 alugou mais filmes em Junho
O customer_id 467 alugou mais filmes em Junho
O customer_id 468 alugou mais filmes em Junho
O customer_id 469 alugou mais filmes em Maio
O customer_id 470 alugou mais filmes em Junho
O customer_id 471 alugou mais filmes em Junho
O customer_id 472 alugou mais filmes em Junho
O customer_id 473 alugou mais filmes em Junho
O customer_id 474 alugou mais filmes em Junho
O customer_id 476 alugou mais filmes em Junho
O customer_id 477 alugou mais filmes em Junho
O customer_id 479 alugou mais filmes em Junho
O customer_id 480 alugou mais filmes em Maio
O customer_id 481 alugou mais filmes em Junho
O customer_id 482 alugou mais filmes em Maio
O customer_id 483 alugou mais filmes em Junho
O customer_id 484 alugou mais filmes em Junho
O customer_id 485 alugou mais filmes em Junho

,first_name_x,last_name_x,customer_id,num_of_rentals_may,num_of_rentals_june,difference
0,MARY,SMITH,1,2,7,-5
1,PATRICIA,JOHNSON,2,1,1,0
2,LINDA,WILLIAMS,3,2,4,-2
3,ELIZABETH,BROWN,5,3,5,-2
4,JENNIFER,DAVIS,6,3,4,-1
...,...,...,...,...,...,...
507,EDUARDO,HIATT,594,4,6,-2
508,TERRENCE,GUNDERSON,595,1,2,-1
509,ENRIQUE,FORSYTHE,596,6,2,4
510,FREDDIE,DUGGAN,597,2,3,-1
511,AUSTIN,CINTRON,599,1,4,-3

In [88]:
def compare_films2(data_may, data_june):
    data_combined = pd.merge(data_may, data_june, on='customer_id')
    data_combined.rename(columns={'num_of_rentals_x': 'num_of_rentals_may'}, inplace=True)
    data_combined.rename(columns={'num_of_rentals_y': 'num_of_rentals_june'}, inplace=True)
    data_combined.drop(['first_name_y'],axis=1,inplace=True)
    data_combined.drop(['last_name_y'],axis=1,inplace=True)
    data_combined['difference']= data_combined['num_of_rentals_may'] - data_combined['num_of_rentals_june']
    data_combined['month_with_more_rents'] = np.where(data_combined['difference'] > 0, 'MAY',
                                                      np.where(data_combined['difference']==0, 'BOTH', 'JUNE'))
                                                     
    return data_combined
compare_films2(data_may, data_june)

,first_name_x,last_name_x,customer_id,num_of_rentals_may,num_of_rentals_june,difference,month_with_more_rents
0,MARY,SMITH,1,2,7,-5,JUNE
1,PATRICIA,JOHNSON,2,1,1,0,BOTH
2,LINDA,WILLIAMS,3,2,4,-2,JUNE
3,ELIZABETH,BROWN,5,3,5,-2,JUNE
4,JENNIFER,DAVIS,6,3,4,-1,JUNE
...,...,...,...,...,...,...,...
507,EDUARDO,HIATT,594,4,6,-2,JUNE
508,TERRENCE,GUNDERSON,595,1,2,-1,JUNE
509,ENRIQUE,FORSYTHE,596,6,2,4,MAY
510,FREDDIE,DUGGAN,597,2,3,-1,JUNE
511,AUSTIN,CINTRON,599,1,4,-3,JUNE